Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
  uint32_t frontColor = colorHeadlight;
  uint32_t backColor = colorTailLightStop;
  uint32_t leftColor = colorOff;
  uint32_t rightColor = colorOff;

  if (carMotionState == 0) { // STOP
    frontColor = strip.Color(50, 50, 50); // Dim White running light
    backColor = colorTailLightStop;       // Bright Red Brake light
    leftColor = colorOff;
    rightColor = colorOff;
  }
  else if (carMotionState == 1) { // FWD
    frontColor = colorHeadlight;
    backColor = colorTailLightGo;
    leftColor = colorOff;
    rightColor = colorOff;
  }
  else if (carMotionState == 2) { // REV
    frontColor = strip.Color(50, 50, 50);
    backColor = strip.Color(255, 255, 255); // White backup light
    leftColor = colorOff;
    rightColor = colorOff;
  }
  else if (carMotionState == 3) { // LEFT TURN
    frontColor = colorHeadlight;
    backColor = colorTailLightGo;
    leftColor = blinkState ? colorBlinkerOn : colorBlinkerOff;
    rightColor = colorOff;
  }
  else if (carMotionState == 4) { // RIGHT TURN
    frontColor = colorHeadlight;
    backColor = colorTailLightGo;
    leftColor = colorOff;
    rightColor = blinkState ? colorBlinkerOn : colorBlinkerOff;
  }
  
  strip.setPixelColor(0, frontColor); // Index 0 = Front
  strip.setPixelColor(1, leftColor);  // Index 1 = Left
  strip.setPixelColor(2, backColor);  // Index 2 = Back
  strip.setPixelColor(3, rightColor); // Index 3 = Right
  strip.show();
}
// ─────────────────────────────────────────────────────────────
//  SENSOR / ACTUATOR HELPERS
// ─────────────────────────────────────────────────────────────
void beep(int ms) {
  digitalWrite(BUZZER, HIGH);
  delay(ms);
  digitalWrite(BUZZER, LOW);
}
long singlePingCM(unsigned long timeout_us = 20000UL) {
  digitalWrite(TRIG_PIN, LOW);  delayMicroseconds(2);
  digitalWrite(TRIG_PIN, HIGH); delayMicroseconds(10);
  digitalWrite(TRIG_PIN, LOW);
  unsigned long dur = pulseIn(ECHO_PIN, HIGH, timeout_us);
  return dur == 0 ? 9999 : dur / 58;
}
long distanceCM() {
  const int N = 5;
  long d[N];
  for (int i = 0; i < N; i++) { d[i] = singlePingCM(); delay(8); }
  for (int i = 0; i < N-1; i++)
    for (int j = i+1; j < N; j++)
      if (d[j] < d[i]) { long t = d[i]; d[i] = d[j]; d[j] = t; }
  return d[N/2];
}
void aimServo(int angle, bool wait = true) {
  if (angle != currentServoAngle) {
    scanServo.write(angle);
    currentServoAngle = angle;
    if (wait) {
      delay(150); // delay only when waiting is needed (avoid blocking RC loop)
    }
  }
}
int chooseBestTurn() {
  aimServo(TURN_ANGLE_L, true); dL_dist = distanceCM();
  aimServo(TURN_ANGLE_R, true); dR_dist = distanceCM();
  aimServo(TURN_ANGLE_C, true); dC_dist = distanceCM();
  return (dL_dist >= dR_dist) ? +1 : -1;
}
void applyRcCmd(const char* cmd, int spd) {
  int t = spd * 75 / 100; // soft turn speed coefficient
  if      (strcmp(cmd, "F")  == 0) { forward(spd); }
  else if (strcmp(cmd, "B")  == 0) { reverse(spd); }
  else if (strcmp(cmd, "L")  == 0) { pivotLeft(t); }
  else if (strcmp(cmd, "R")  == 0) { pivotRight(t); }
  else if (strcmp(cmd, "FL") == 0) { carMotionState = 1; driveLeft(spd); driveRight(t); }
  else if (strcmp(cmd, "FR") == 0) { carMotionState = 1; driveLeft(t);   driveRight(spd); }
  else if (strcmp(cmd, "BL") == 0) { carMotionState = 2; driveLeft(-t);  driveRight(-spd); }
  else if (strcmp(cmd, "BR") == 0) { carMotionState = 2; driveLeft(-spd);driveRight(-t); }
  else                             { stopAll(); }
}
void webSocketEvent(uint8_t num, WStype_t type, uint8_t * payload, size_t length) {
  switch(type) {
    case WStype_DISCONNECTED:
      Serial.printf("[%u] Disconnected!\n", num);
      break;
    case WStype_CONNECTED: {
      IPAddress ip = webSocket.remoteIP(num);
      Serial.printf("[%u] Connected from %s\n", num, ip.toString().c_str());
      break;
    }
    case WStype_TEXT: {
      String msg = String((char*)payload);
      if (msg.startsWith("g:")) {
        int colon1 = msg.indexOf(':', 2);
        if (colon1 != -1) {
          String cmd = msg.substring(2, colon1);
          int speed = msg.substring(colon1 + 1).toInt();
          if (carMode == MODE_GESTURE) {
            applyRcCmd(cmd.c_str(), speed);
          }
        }
      } else if (msg.startsWith("cmd:")) {
        String cmd = msg.substring(4);
        if (carMode == MODE_RC) {
          strlcpy(rcCmd, cmd.c_str(), sizeof(rcCmd));
        }
      } else if (msg.startsWith("speed:")) {
        int pct = msg.substring(6).toInt();
        pct = constrain(pct, 10, 100);
        rcSpeed = (int)(RC_SPEED_DEF * pct / 100);
      } else if (msg.startsWith("servo:")) {
        rcServoAngle = constrain(msg.substring(6).toInt(), 0, 180);
      } else if (msg.startsWith("horn:")) {
        rcHornOn = (msg.substring(5) == "1");
      } else if (msg.startsWith("mode:")) {
        String m = msg.substring(5);
        stopAll();
        strlcpy(rcCmd, "S", sizeof(rcCmd));
        if (m == "rc") {
          carMode = MODE_RC;
          beep(80);
        } else if (m == "gesture") {
          carMode = MODE_GESTURE;
          beep(80);
        } else if (m == "follow") {
          carMode = MODE_FOLLOW;
          beep(80);
        } else {
          carMode = MODE_OA;
          beep(80); delay(80); beep(80);
          rcServoAngle = TURN_ANGLE_C;
        }
      }
      break;
    }
    default:
      break;
  }
}
void handleRoot() {
  String page = R"rawhtml(
<!DOCTYPE html>
<html>
<head>
  <meta charset='UTF-8'>
  <meta name='viewport' content='width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no'>
  <title>GHOST DRIVE // SCANNER DECK</title>
  <link href="https://fonts.googleapis.com/css2?family=Outfit:wght@400;600;700;800&family=JetBrains+Mono:wght@700&display=swap" rel="stylesheet">
  <style>
    :root {
      --bg-color: #06070d;
      --card-bg: rgba(16, 18, 35, 0.55);
      --card-border: rgba(255, 255, 255, 0.05);
      --accent-primary: #6366f1; /* Indigo for RC */
      --accent-primary-glow: rgba(99, 102, 241, 0.25);
      --accent-success: #10b981; /* Emerald for Autopilot */
      --accent-success-glow: rgba(16, 185, 129, 0.25);
      --accent-gesture: #06b6d4; /* Cyan for Gesture Control */
      --accent-gesture-glow: rgba(6, 182, 212, 0.25);
      --accent-follow: #a855f7; /* Purple for Human Following */
      --accent-follow-glow: rgba(168, 85, 247, 0.25);
      --accent-danger: #f43f5e; /* Rose for Alerts/Horn */
      --accent-danger-glow: rgba(244, 63, 94, 0.3);
      --text-main: #f9fafb;
      --text-muted: #6b7280;
      
      /* Dynamic theme targets */
      --accent-active: var(--accent-success);
      --accent-active-glow: var(--accent-success-glow);
    }
    
    * {
      box-sizing: border-box;
      margin: 0;
      padding: 0;
      -webkit-tap-highlight-color: transparent;
      user-select: none;
    }
    
    body {
      font-family: 'Outfit', sans-serif;
      background-color: var(--bg-color);
      color: var(--text-main);
      background-image: 
      	radial-gradient(circle at 10% 20%, rgba(99, 102, 241, 0.12) 0%, transparent 40%),
      	radial-gradient(circle at 90% 80%, rgba(16, 185, 129, 0.08) 0%, transparent 40%);
      background-attachment: fixed;
      min-height: 100vh;
      display: flex;
      flex-direction: column;
      align-items: center;
      padding: 16px;
      overflow-x: hidden;
    }
    .app-container {
      width: 100%;
      max-width: 440px;
      display: flex;
      flex-direction: column;
      gap: 16px;
    }
    /* Active theme modifiers */
    .app-container.theme-oa {
      --accent-active: var(--accent-success);
      --accent-active-glow: var(--accent-success-glow);
    }
    .app-container.theme-rc {
      --accent-active: var(--accent-primary);
      --accent-active-glow: var(--accent-primary-glow);
    }
    .app-container.theme-gesture {
      --accent-active: var(--accent-gesture);
      --accent-active-glow: var(--accent-gesture-glow);
    }
    .app-container.theme-follow {
      --accent-active: var(--accent-follow);
      --accent-active-glow: var(--accent-follow-glow);
    }
    /* Header styling */
    .header {
      width: 100%;
      display: flex;
      justify-content: space-between;
      align-items: center;
      padding: 4px 6px;
    }
    
    .logo-area {
      display: flex;
      align-items: center;
      gap: 8px;
    }
    
    .pulse-indicator {
      width: 8px;
      height: 8px;
      background-color: var(--accent-active);
      border-radius: 50%;
      box-shadow: 0 0 8px var(--accent-active);
      transition: all 0.3s ease;
      animation: pulse 1.8s infinite;
    }
    
    @keyframes pulse {
      0% { transform: scale(0.95); opacity: 0.6; }
      50% { transform: scale(1.15); opacity: 1; }
      100% { transform: scale(0.95); opacity: 0.6; }
    }
    
