Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
  // Initialize Websocket connection
  initWebSocket();
  
  // Fallback HTTP status polling loop (if WebSocket is down)
  setInterval(() => {
    if (!socket || socket.readyState !== WebSocket.OPEN) {
      fetchTelemetry();
    }
  }, 400);
</script>
</body>
</html>
)rawhtml";
  server.send(200, "text/html", page);
}
void handleSetMode() {
  String m = server.arg("mode");
  stopAll();
  strlcpy(rcCmd, "S", sizeof(rcCmd));
  if (m == "rc") {
    carMode = MODE_RC;
    beep(80);
  } else if (m == "gesture") {
    carMode = MODE_GESTURE;
    beep(80);
  } else if (m == "follow") {
    carMode = MODE_FOLLOW;
    beep(80);
  } else {
    carMode = MODE_OA;
    beep(80); delay(80); beep(80);
    rcServoAngle = TURN_ANGLE_C; // Request centering in the main loop thread
  }
  server.send(200, "text/plain", "ok");
}
void handleCmd() {
  String d = server.arg("d");
  strlcpy(rcCmd, d.c_str(), sizeof(rcCmd));
  server.send(200, "text/plain", "ok");
}
void handleHorn() {
  rcHornOn = (server.arg("on") == "1");
  server.send(200, "text/plain", "ok");
}
void handleSpeed() {
  int pct = server.arg("v").toInt();
  pct = constrain(pct, 10, 100);
  rcSpeed = (int)(RC_SPEED_DEF * pct / 100);
  server.send(200, "text/plain", "ok");
}
void handleServo() {
  rcServoAngle = constrain(server.arg("a").toInt(), 0, 180);
  server.send(200, "text/plain", "ok");
}
void handleStatus() {
  String modeStr = "oa";
  if (carMode == MODE_RC) modeStr = "rc";
  else if (carMode == MODE_GESTURE) modeStr = "gesture";
  else if (carMode == MODE_FOLLOW) modeStr = "follow";
  
  String json = "{";
  json += "\"mode\":\"" + modeStr + "\",";
  json += "\"dist\":" + String(lastDistance) + ",";
  json += "\"angle\":" + String(currentServoAngle) + ",";
  json += "\"ir\":" + String(lastIR) + ",";
  json += "\"dL\":" + String(dL_dist) + ",";
  json += "\"dC\":" + String(dC_dist) + ",";
  json += "\"dR\":" + String(dR_dist);
  json += "}";
  server.send(200, "application/json", json);
}
// ─────────────────────────────────────────────────────────────
//  SETUP
// ─────────────────────────────────────────────────────────────
void setup() {
  Serial.begin(115200);
  // Motor pins
  pinMode(L_AIN1, OUTPUT); pinMode(L_AIN2, OUTPUT);
  pinMode(L_BIN1, OUTPUT); pinMode(L_BIN2, OUTPUT);
  pinMode(R_AIN1, OUTPUT); pinMode(R_AIN2, OUTPUT);
  pinMode(R_BIN1, OUTPUT); pinMode(R_BIN2, OUTPUT);
  // LEDC – Setup (Compatible with both Core v2.x and v3.x)
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcAttach(L_PWMA, PWM_FREQ, PWM_RES_BITS);
  ledcAttach(L_PWMB, PWM_FREQ, PWM_RES_BITS);
  ledcAttach(R_PWMA, PWM_FREQ, PWM_RES_BITS);
  ledcAttach(R_PWMB, PWM_FREQ, PWM_RES_BITS);
#else
  ledcSetup(CH_L_PWMA, PWM_FREQ, PWM_RES_BITS);
  ledcSetup(CH_L_PWMB, PWM_FREQ, PWM_RES_BITS);
  ledcSetup(CH_R_PWMA, PWM_FREQ, PWM_RES_BITS);
  ledcSetup(CH_R_PWMB, PWM_FREQ, PWM_RES_BITS);
  ledcAttachPin(L_PWMA, CH_L_PWMA);
  ledcAttachPin(L_PWMB, CH_L_PWMB);
  ledcAttachPin(R_PWMA, CH_R_PWMA);
  ledcAttachPin(R_PWMB, CH_R_PWMB);
#endif
  // Standby pin
  pinMode(STBY_PIN, OUTPUT);
  digitalWrite(STBY_PIN, HIGH);
  // Sensors & Horn
  pinMode(TRIG_PIN, OUTPUT);
  pinMode(ECHO_PIN, INPUT);
  pinMode(BUZZER, OUTPUT);
  digitalWrite(BUZZER, LOW);
  // Servo timer allocation to prevent LEDC conflict with motor channels 0-3
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);
  // NeoPixel Strip Initialization
  strip.begin();
  strip.show();

  // Servo
  scanServo.setPeriodHertz(50);
  scanServo.attach(SERVO_PIN, 500, 2500);
  aimServo(TURN_ANGLE_C, true);
  stopAll();
  // WiFi Setup (Hotspot AP or Station Router mode)
  if (WIFI_AP_MODE) {
    WiFi.softAP(WIFI_SSID, WIFI_PASS);
    Serial.print("Access Point started. IP: ");
    Serial.println(WiFi.softAPIP());
  } else {
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    Serial.print("Connecting to WiFi");
    unsigned long startAttempt = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - startAttempt < 10000) {
      delay(500);
      Serial.print(".");
    }
    Serial.println();
    if (WiFi.status() == WL_CONNECTED) {
      Serial.print("Connected to WiFi. IP: ");
      Serial.println(WiFi.localIP());
    } else {
      Serial.println("Connection failed! Defaulting to Hotspot Mode...");
      WiFi.softAP(WIFI_SSID, WIFI_PASS);
      Serial.print("Access Point started. IP: ");
      Serial.println(WiFi.softAPIP());
    }
  }
  // Web routes
  server.on("/",       handleRoot);
  server.on("/rc",     []() { server.sendHeader("Location", "/"); server.send(302, "text/plain", "Redirecting..."); });
  server.on("/set",    handleSetMode);
  server.on("/cmd",    handleCmd);
  server.on("/horn",   handleHorn);
  server.on("/speed",  handleSpeed);
  server.on("/servo",  handleServo);
  server.on("/status", handleStatus);
  server.onNotFound([]() { server.send(404, "text/plain", "Not Found"); });
  server.begin();
  
  // Start WebSocket Server
  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
  
  beep(100);
  Serial.println("System initialized. HTTP & WebSocket servers running.");
}
// ─────────────────────────────────────────────────────────────
//  LOOP
// ─────────────────────────────────────────────────────────────
void loop() {
  server.handleClient();   // Always handle incoming HTTP requests
  webSocket.loop();        // Keep the WebSocket server listening
  updateLEDs();            // Update NeoPixel headlights/brake lights/blinkers
  
  // Update servo angle safely in loop context
  if (carMode == MODE_OA) {
    aimServo(TURN_ANGLE_C, false);
  } else if (carMode == MODE_RC || carMode == MODE_GESTURE) {
    aimServo(rcServoAngle, false);
  }
  
  // Broadcast WebSocket telemetry at 150ms intervals
  static unsigned long lastWsTelemetry = 0;
  if (millis() - lastWsTelemetry > 150) {
    lastWsTelemetry = millis();
    String modeStr = "oa";
    if (carMode == MODE_RC) modeStr = "rc";
    else if (carMode == MODE_GESTURE) modeStr = "gesture";
    else if (carMode == MODE_FOLLOW) modeStr = "follow";
    
    String json = "{";
    json += "\"mode\":\"" + modeStr + "\",";
    json += "\"dist\":" + String(lastDistance) + ",";
    json += "\"angle\":" + String(currentServoAngle) + ",";
    json += "\"ir\":" + String(lastIR) + ",";
    json += "\"dL\":" + String(dL_dist) + ",";
    json += "\"dC\":" + String(dC_dist) + ",";
    json += "\"dR\":" + String(dR_dist);
    json += "}";
    webSocket.broadcastTXT(json);
  }
  
  if (carMode == MODE_OA) {
    // ── Obstacle Avoidance (Autopilot Mode) ───────────────────
    long dC = distanceCM();
    int ir = analogRead(IR_PIN);
    lastDistance = dC;
    lastIR = ir;
    dC_dist = dC;
    // Edge/cliff protection
    if (ir < IR_THRESHOLD) {
      stopAll(); beep(60);
      reverse(OA_REVERSE); delay(REVERSE_MS);
      int dir = chooseBestTurn();
      (dir > 0) ? pivotLeft(OA_TURN) : pivotRight(OA_TURN);
      delay(PIVOT_MS); stopAll();
      return;
    }
    // Ultrasonic collision avoidance
    if (dC <= SAFE_DIST_CM) {
      stopAll(); beep(60);
      reverse(OA_REVERSE); delay(REVERSE_MS); stopAll();
      int dir = chooseBestTurn();
      (dir > 0) ? pivotLeft(OA_TURN) : pivotRight(OA_TURN);
      delay(PIVOT_MS); stopAll();
    } else {
      int spd = (dC >= CLEAR_DIST_CM) ? OA_SPEED : OA_SPEED * 3 / 4;
      forward(spd);
    }
    delay(20);
  } else if (carMode == MODE_RC) {
    // ── RC Web Control Mode ──────────────────────────────────
    digitalWrite(BUZZER, rcHornOn ? HIGH : LOW);
    applyRcCmd(rcCmd, rcSpeed);
    static unsigned long lastSensorUpdate = 0;
    if (millis() - lastSensorUpdate > 150) {
      lastSensorUpdate = millis();
      lastDistance = singlePingCM(15000UL);
      lastIR = analogRead(IR_PIN);
    }
    delay(15);
  } else if (carMode == MODE_GESTURE) {
    // ── Gesture Control Mode ─────────────────────────────────
    digitalWrite(BUZZER, rcHornOn ? HIGH : LOW);
    static unsigned long lastSensorUpdate = 0;
    if (millis() - lastSensorUpdate > 150) {
      lastSensorUpdate = millis();
      lastDistance = singlePingCM(15000UL);
      lastIR = analogRead(IR_PIN);
    }
    delay(15);
  } else if (carMode == MODE_FOLLOW) {
    // ── Human / Hand Following Mode ───────────────────────────
    // Follows hand forward when detected (5-35 cm). Stops when close (< 5 cm) or lost. No reverse. No IR reads.

    unsigned long now = millis();
    static unsigned long lastScanTime = 0;
    static long lastValidDist = 999;

    if (!followFound) {
      // ── Search State (Sweeping) ───────────────────────────
      stopAll();

      // Sweep servo slowly
      followAngle += followSweepDir;
      if (followAngle >= 120) {
        followAngle = 120;
        followSweepDir = -4;
      } else if (followAngle <= 60) {
        followAngle = 60;
        followSweepDir = 4;
      }
      aimServo(followAngle, false);
      currentServoAngle = followAngle;

