Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
      // Ping to find targets
      long d = singlePingCM(15000UL);
      lastDistance = d;
      dC_dist = d;

      // Lock on if hand is detected between 5 cm and 35 cm
      if (d >= 5 && d <= 35) {
        followFound = true;
        lostFollowTime = now;
        lastValidDist = d;
        lastScanTime = 0; // reset scan cooldown
        beep(70); // Lock feedback
      }
      delay(60);
    } else {
      // ── Locked Tracking State (Quiet search-on-loss with 600ms Cooldown) ──
      // Servo points straight at followAngle. No wiggling if hand is steady!
      aimServo(followAngle, false);
      currentServoAngle = followAngle;
      
      long d = singlePingCM(12000UL);
      dC_dist = d;

      if (d >= 5 && d <= 35) {
        // Hand is still directly in front of the servo!
        lostFollowTime = now;
        lastValidDist = d;
        lastDistance = d;
        dL_dist = 999;
        dR_dist = 999;

        // Drive to maintain 7cm distance (stops if < 5cm, no reverse)
        if (d < 5) {
          stopAll();
        } else {
          if (followAngle > 105) {
            pivotLeft(OA_TURN * 6 / 10);  // slow left turn
          } else if (followAngle < 75) {
            pivotRight(OA_TURN * 6 / 10); // slow right turn
          } else {
            forward(OA_SPEED * 6 / 10);   // drive straight forward
          }
        }
      } else {
        // Center reading is lost! Stop motors.
        stopAll();

        // Scan left/right ONLY once every 600ms to prevent vibration
        if (now - lastScanTime > 600) {
          lastScanTime = now;

          // Scan Left
          int angleL = constrain(followAngle + 18, 45, 135);
          aimServo(angleL, false);
          delay(80); // allow servo to settle
          long dL_s = singlePingCM(12000UL);
          dL_dist = dL_s;

          // Scan Right
          int angleR = constrain(followAngle - 18, 45, 135);
          aimServo(angleR, false);
          delay(80); // allow servo to settle
          long dR_s = singlePingCM(12000UL);
          dR_dist = dR_s;

          // Restore center servo position
          aimServo(followAngle, false);

          if (dL_s >= 5 && dL_s <= 35 && (dR_s > dL_s || dR_s > 35)) {
            // Hand is on the left
            followAngle = constrain(followAngle + 15, 60, 120);
            lostFollowTime = now;
            lastValidDist = dL_s;
          } else if (dR_s >= 5 && dR_s <= 35 && (dL_s > dR_s || dL_s > 35)) {
            // Hand is on the right
            followAngle = constrain(followAngle - 15, 60, 120);
            lostFollowTime = now;
            lastValidDist = dR_s;
          }
        }

        // If target lost for more than 1500 ms, break lock
        if (now - lostFollowTime > 1500) {
          followFound = false;
          beep(50);
          delay(50);
          beep(50);
        }
      }
      delay(40); // 25Hz loop
    }
  }
}
